# Напишите программу, которая принимает на вход число и пЧисло является чётнымроверяет, является ли оно чётным.
# Если число чётное, программа должна вывести сообщение "", в противном
# случае - "Число не является чётным".

a = int(input('vvedite celoe chislo '))
if a % 2 == 0:
    print ('Число является чётным')
